Revit 2027 API
AssetSet Class
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Visual.AssetSet
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssetSet : APIObject, IEnumerable
Public Class AssetSet
	Inherits APIObject
	Implements IEnumerable
public ref class AssetSet : public APIObject,
	IEnumerable
type AssetSet =
    class
        inherit APIObject
        interface IEnumerable
    end
The AssetSet type exposes the following members.
Constructors
Name | Description
AssetSet | Initializes a new instance of the AssetSet class
Top
Properties
Name | Description
IsEmpty
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
Size
Top
Methods
Name | Description
Clear
Contains
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
Erase
ForwardIterator
GetEnumerator
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
Insert
ReverseIterator
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace